posts/choosing-a-blogging-tool/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Choosing a blogging tool | Lightly Seared On The Reality Grill</title>
<link href="../../assets/css/all.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://samjuvonen.com/posts/choosing-a-blogging-tool/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="sjj">
<link rel="prev" href="../to-blog-or-not/" title="To blog, or not" type="text/html">
<link rel="next" href="../printing-pretty-from-emacs/" title="Printing pretty from Emacs" type="text/html">
<meta property="og:site_name" content="Lightly Seared On The Reality Grill">
<meta property="og:title" content="Choosing a blogging tool">
<meta property="og:url" content="http://samjuvonen.com/posts/choosing-a-blogging-tool/">
<meta property="og:description" content="So, once one has decided to cast one's words out to the merciless seas of
    information a.k.a. The Internet, how to go about it?



The easiest solution is of course using one of the many pre-packag">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2016-08-18T12:17:14-07:00">
</head>
<body class="theme-base-0b">
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A blog by Sam Juvonen.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="http://samjuvonen.com/" title="Lightly Seared On The Reality Grill" rel="home">Lightly Seared On The Reality Grill</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Choosing a blogging tool</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">sjj</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2016-08-18T12:17:14-07:00" itemprop="datePublished" title="2016-08-18 12:17">2016-08-18 12:17</time></a></p>
                <p class="commentline">
        
    <a href="#disqus_thread" data-disqus-identifier="cache/posts/choosing-a-blogging-tool.html">Comments</a>


        </p>
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
So, once one has decided to cast one's words out to the merciless seas of
    information a.k.a. The Internet, how to go about it?
</p>

<p>
The easiest solution is of course using one of the many pre-packaged blog
sites (Blogger, Wordpress, etc). This is a perfectly valid way to do it,
especially if one is not technically inclined. But, you know, boring if one is.
</p>

<p>
I want to keep things as simple as possible, make sure I own my data, have
total freedom to play with templates and themes, and have flexibility with
how to write for the site. I don't want to deal with the headaches
associated with running a database backed site like Wordpress either.
</p>

<p>
The best thing is a static site generator. The idea has been around forever,
it's how it all worked on the early internet (well, except all the HTML was
hand crafted, or you used some terrible "HTML editor"). There are dozens
of the modern static site generators around, from Jekyll which made it
popular, to he new hotness on the block, Hugo. I chose to go with neither of
those. Instead I chose <a href="http://getnikola.com">Nikola</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Why Nikola</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://getnikola.com">Nikola</a> has been around for a while. It may not be as popular as some of the
other comparable tools, but it is certainly one of the most flexible. It
supports most markup languages out of the box: Markdown, Restructured Text,
Asciidoc, even Emacs Orgmode as well as hand-written HTML. The competition
tends to be mostly just Markdown.
</p>

<p>
It is written in Python, which I understand better than Ruby or Go. It
seems to be the most active of the Python-based systems today. I haven't
delved into the source, but it appears altogether well thought out.
</p>

<p>
The only downside with Nikola, and most likely the reason it is not as
popular as it could be, is that its theme selection is rather limited and
frankly not very pretty. Since I've taken an interest in front-end web dev
lately (just for fun for now), I'm hoping I can contribute a theme or two. So
for me personally this downside is an opportunity.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Why Github Pages</h2>
<div class="outline-text-2" id="text-2">
<p>
For a tech-focused blog, publishing for free on <a href="https://pages.github.com">Github Pages</a> (github.io) is
a no-brainer. With a static blog engine, you get the freedom to work on
your posts anywhere, even offline. And with Github, you of course have your
precious writing under version control. Backups are never more than a
simple <code>git clone</code> / <code>git pull</code>. And should I decide to move elsewhere, I can
just <code>git push</code> to an AWS <a href="http://docs.aws.amazon.com/AmazonS3/latest/dev/WebsiteHosting.html">S3 backed static blog</a>, for example.
</p>

<p>
Nikola has support for Github Pages, <code>nikola github_deploy</code> does all the
magic, putting the source files in one git branch, and the rendered HTML
into the master branch. 
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Here today</h2>
<div class="outline-text-2" id="text-3">
<p>
This is where I'm today. If Nikola turns out to be more pain than it's
worth, I can easily switch to another site generator. I own my own data,
it's in plain text, the data format of kings and unix beards. The software
is free and Free. Isn't modern life pretty damn wonderful?
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul class="pager hidden-print">
<li class="previous">
                <a href="../to-blog-or-not/" rel="prev" title="To blog, or not">Previous post</a>
            </li>
            <li class="next">
                <a href="../printing-pretty-from-emacs/" rel="next" title="Printing pretty from Emacs">Next post</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>Comments</h2>
        
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="samjuvonen",
            disqus_url="http://samjuvonen.com/posts/choosing-a-blogging-tool/",
        disqus_title="Choosing a blogging tool",
        disqus_identifier="cache/posts/choosing-a-blogging-tool.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section></article><script>var disqus_shortname="samjuvonen";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script><footer id="footer"><p>Contents © 2016         <a href="mailto:info@samjuvonen.com">sjj</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
